; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_3 object type_1 type_2)
 (:predicates (pred_4 ?v2 - type_1 ?v7 - type_3)
 	      (pred_1 ?v5 - object ?v7 - type_3)
	      (pred_3 ?v2 - type_1 ?v3 - type_2)
	      (pred_2 ?v2 - type_1 ?v5 - object ?v3 - type_2))

   (:action op_2
       :parameters  (?v2 - type_1 ?v8 ?v6 - type_3)
       :precondition (and  (pred_4 ?v2 ?v8))
       :effect (and  (pred_4 ?v2 ?v6)
		     (not (pred_4 ?v2 ?v8))))

   (:action op_3
       :parameters (?v2 - type_1 ?v1 - object ?v4 - type_3 ?v3 - type_2)
       :precondition  (and  (pred_1 ?v1 ?v4) (pred_4 ?v2 ?v4) (pred_3 ?v2 ?v3))
       :effect (and (pred_2 ?v2 ?v1 ?v3)
		    (not (pred_1 ?v1 ?v4)) 
		    (not (pred_3 ?v2 ?v3))))

   (:action op_1
       :parameters (?v2 - type_1 ?v1 - object ?v4 - type_3 ?v3 - type_2)
       :precondition  (and  (pred_2 ?v2 ?v1 ?v3) (pred_4 ?v2 ?v4))
       :effect (and (pred_1 ?v1 ?v4)
		    (pred_3 ?v2 ?v3)
		    (not (pred_2 ?v2 ?v1 ?v3)))))

; problem
(define (problem gripper-1-4-3)
(:domain gripper-strips)
(:objects obj_06 - type_1
obj_01 obj_03 - type_2
obj_04 obj_07 obj_08 obj_05 - type_3
obj_09 obj_10 obj_02 - object)
(:init
(pred_4 obj_06 obj_08)
(pred_3 obj_06 obj_01)
(pred_3 obj_06 obj_03)
(pred_1 obj_09 obj_04)
(pred_1 obj_10 obj_08)
(pred_1 obj_02 obj_08)
)
(:goal
(and
(pred_1 obj_09 obj_07)
(pred_1 obj_10 obj_05)
(pred_1 obj_02 obj_08)
)
)

(:constraints
  (always (forall (?b - object)
           (not (pred_2 obj_06 ?b obj_03))))
)
)

; plan
1. (op_3 obj_06 obj_10 obj_08 obj_01)
   deleted: (pred_1 obj_10 obj_08) (pred_3 obj_06 obj_01)
   added: (pred_2 obj_06 obj_10 obj_01)
   goals met: 1 of 3
2. (op_2 obj_06 obj_08 obj_05)
   deleted: (pred_4 obj_06 obj_08)
   added: (pred_4 obj_06 obj_05)
   goals met: 1 of 3
3. (op_1 obj_06 obj_10 obj_05 obj_01)
   deleted: (pred_2 obj_06 obj_10 obj_01)
   added: (pred_1 obj_10 obj_05) (pred_3 obj_06 obj_01)
   goals met: 2 of 3
4. (op_2 obj_06 obj_05 obj_04)
   deleted: (pred_4 obj_06 obj_05)
   added: (pred_4 obj_06 obj_04)
   goals met: 2 of 3
5. (op_3 obj_06 obj_09 obj_04 obj_01)
   deleted: (pred_1 obj_09 obj_04) (pred_3 obj_06 obj_01)
   added: (pred_2 obj_06 obj_09 obj_01)
   goals met: 2 of 3
6. (op_2 obj_06 obj_04 obj_07)
   deleted: (pred_4 obj_06 obj_04)
   added: (pred_4 obj_06 obj_07)
   goals met: 2 of 3
7. (op_1 obj_06 obj_09 obj_07 obj_01)
   deleted: (pred_2 obj_06 obj_09 obj_01)
   added: (pred_1 obj_09 obj_07) (pred_3 obj_06 obj_01)
   goals met: 3 of 3
